app/Models/Empleados_Model.php

INSERT INTO `empleado` (`nombres`, `primerApellido`, `segundoApellido`, `ci`, `expedicion`, `usuario`, `contrasena`, `tipo`, `estado`) VALUES ('Roxemberg', 'Gomez', '', '7538964', 'CH', 'rgomez', '577f83e9fe79b904755036d86854a98e', 'ejecutor', '2')
---
	public function agregarempleado($data)
	{
		$this->insert($data);