app/Models/Reporte_Model.php

SELECT `i`.`idInforme`, `i`.`tipoInforme`, `i`.`nroInforme`, `i`.`informe`, `i`.`fechaInicio`, `i`.`fechaConclusion`, `i`.`fechaPresentacion`, `i`.`wp`, `i`.`tipoWp`, `i`.`comentarios`, `i`.`fechaRegistro`, `i`.`estado`, `i`.`idEmpleado`, `ep`.`nombres`, `ep`.`primerApellido`, `ep`.`segundoApellido`
FROM `informe` `i`
JOIN `empleado` `ep` ON `ep`.`idEmpleado` = `i`.`idEmpleado`
WHERE `i`.`tipoInforme` = 'P'
AND `i`.`estado` IN ('3','4','5')
---
	public function pwp()
	{
		return $this->db->table('informe i')
                ->select('i.idInforme, i.tipoInforme, i.nroInforme, i.informe, i.fechaInicio, i.fechaConclusion, i.fechaPresentacion, i.wp, i.tipoWp, i.comentarios, i.fechaRegistro, i.estado, i.idEmpleado, ep.nombres, ep.primerApellido, ep.segundoApellido')
                ->where('i.tipoInforme', 'P')
				->whereIn('i.estado',['3','4','5'])
                ->join('empleado ep', 'ep.idEmpleado = i.idEmpleado')
                ->get();

SELECT `i`.`idInforme`, `i`.`tipoInforme`, `i`.`nroInforme`, `i`.`informe`, `i`.`fechaInicio`, `i`.`fechaConclusion`, `i`.`fechaPresentacion`, `i`.`wp`, `i`.`tipoWp`, `i`.`comentarios`, `i`.`fechaRegistro`, `i`.`estado`, `i`.`idEmpleado`, `ep`.`nombres`, `ep`.`primerApellido`, `ep`.`segundoApellido`
FROM `informe` `i`
JOIN `empleado` `ep` ON `ep`.`idEmpleado` = `i`.`idEmpleado`
WHERE `i`.`tipoInforme` = 'NP'
AND `i`.`estado` IN ('3','4','5')
---
	public function npwp()
	{
		return $this->db->table('informe i')
                ->select('i.idInforme, i.tipoInforme, i.nroInforme, i.informe, i.fechaInicio, i.fechaConclusion, i.fechaPresentacion, i.wp, i.tipoWp, i.comentarios, i.fechaRegistro, i.estado, i.idEmpleado, ep.nombres, ep.primerApellido, ep.segundoApellido')
				->where('i.tipoInforme', 'NP')
				->whereIn('i.estado',['3','4','5'])
                ->join('empleado ep', 'ep.idEmpleado = i.idEmpleado')
                ->get();

SELECT `i`.`idInforme`, `i`.`tipoInforme`, `i`.`nroInforme`, `i`.`informe`, `i`.`fechaInicio`, `i`.`fechaConclusion`, `i`.`fechaPresentacion`, `i`.`wp`, `i`.`tipoWp`, `i`.`comentarios`, `i`.`fechaRegistro`, `i`.`estado`, `i`.`idEmpleado`, `ep`.`nombres`, `ep`.`primerApellido`, `ep`.`segundoApellido`
FROM `informe` `i`
JOIN `empleado` `ep` ON `ep`.`idEmpleado` = `i`.`idEmpleado`
WHERE `i`.`estado` = '5'
---
	public function rwp()
	{
		return $this->db->table('informe i')
                ->select('i.idInforme, i.tipoInforme, i.nroInforme, i.informe, i.fechaInicio, i.fechaConclusion, i.fechaPresentacion, i.wp, i.tipoWp, i.comentarios, i.fechaRegistro, i.estado, i.idEmpleado, ep.nombres, ep.primerApellido, ep.segundoApellido')
				->where('i.estado', '5')
                ->join('empleado ep', 'ep.idEmpleado = i.idEmpleado')
                ->get();

SELECT *
FROM `empleado`
WHERE `estado` = '1'
---
	public function asignacion()
	{
		return $this->db->table('empleado')
		->where('estado', '1')
		->get();