app/Models/Usuario_Model.php

    public function validar($usuario, $contrasena, $estado)
    {
        return $this->db->table($this->table)
            ->select('idEmpleado, usuario, tipo, estado')
            ->where('usuario', $usuario)
            ->where('contrasena', $contrasena)
            ->where('estado', $estado)
            ->get();
---
SELECT `idEmpleado`, `usuario`, `tipo`, `estado`
FROM `empleado`
WHERE `usuario` = 'fmichel'
AND `contrasena` = '577f83e9fe79b904755036d86854a98e'
AND `estado` = '1'

	public function recuperarusuario($idUsuario)
	{
		return $this->db->table('empleado')
		->select('*')
		->where('idEmpleado',$idUsuario)
		->get();
---
SELECT *
FROM `empleado`
WHERE `idEmpleado` = '2'