app/Models/Wp_Model.php

SELECT `i`.`idInforme`, `i`.`nroInforme`, `i`.`informe`, `i`.`fechaPresentacion`, `i`.`wp`, `i`.`tipoWp`, `i`.`comentarios`, `i`.`fechaRegistro`, `i`.`estado`, `i`.`idEmpleado`, `ep`.`nombres`, `ep`.`primerApellido`, `ep`.`segundoApellido`
FROM `informe` `i`
JOIN `empleado` `ep` ON `ep`.`idEmpleado` = `i`.`idEmpleado`
WHERE `i`.`estado` = '1'
OR `i`.`estado` = '2'
---
    public function wp()
    {
        return $this->db->table('informe i')
                ->select('i.idInforme, i.nroInforme, i.informe, i.fechaPresentacion, i.wp, i.tipoWp, i.comentarios, i.fechaRegistro, i.estado, i.idEmpleado, ep.nombres, ep.primerApellido, ep.segundoApellido')
                ->where('i.estado', '1')
                ->orWhere('i.estado', '2')
                ->join('empleado ep', 'ep.idEmpleado = i.idEmpleado')
                ->get();

SELECT `i`.`idInforme`, `i`.`tipoInforme`, `i`.`nroInforme`, `i`.`informe`, `i`.`fechaInicio`, `i`.`fechaConclusion`, `i`.`fechaPresentacion`, `i`.`wp`, `i`.`tipoWp`, `i`.`comentarios`, `i`.`fechaRegistro`, `i`.`estado`, `i`.`idEmpleado`, `ep`.`nombres`, `ep`.`primerApellido`, `ep`.`segundoApellido`
FROM `informe` `i`
JOIN `empleado` `ep` ON `ep`.`idEmpleado` = `i`.`idEmpleado`
WHERE `i`.`idInforme` = '24'
---
       public function recuperaractividad($idInforme)
    {
        return $this->db->table('informe i')
            ->select('i.idInforme, i.tipoInforme, i.nroInforme, i.informe, i.fechaInicio, i.fechaConclusion, i.fechaPresentacion, i.wp, i.tipoWp, i.comentarios, i.fechaRegistro, i.estado, i.idEmpleado, ep.nombres, ep.primerApellido, ep.segundoApellido')
            ->where('i.idInforme', $idInforme)
            ->join('empleado ep', 'ep.idEmpleado = i.idEmpleado')
            ->get();